; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 2.0.0
; Author: wvxwxvw
; Homepage: http://forum.ru-board.com/topic.cgi?forum=5&topic=20420&start=2340#lt
;
; Updating translations:
;   Before updating a translation, please make sure you have the current development version of
;   	Universal Extractor by enabling the 'Install beta updates' option in preferences and searching
;   	for updates by clicking 'Check for Updates' in the help menu.
; 	Make sure to read the messages titled 'Breaking changes' - which can be found at
;		https://github.com/Bioruebe/UniExtract2/issues/2 - for a list of changes to already translated
;   	terms. Please compare the affected translations with the always up-to-date English language file
;		and edit them to reflect the changes.
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file. Simply delete the Homepage line if you don't have one. Credit
;		yourself in the ABOUT_INFO_LABEL term if you want to.
;	Save the file in Unicode format (UTF-16/UCS-2 Little Endian) and send it to the developers - 
;		via Github: https://github.com/Bioruebe/UniExtract2/issues/2 or 
;		per e-mail to the address listed at https://bioruebe.com/contact/
;
;	The following symbols have special meanings:
;	& 		  - when used in a GUI label or button, it precedes the letter that will be registered 
;				as a hotkey. Each letter should only be used once per menu.
;	%name	  - will be replaced with 'Universal Extractor'
;	%n	 	  - indicates a newline character
;	%t	  	  - indicates a tab character
;	%1,%2,... - indicates a string variable that UniExtract will replace
;		The content of each %1,... variable is hardcoded into UniExtract.
;		The numbered variables' order can be switched to fit your language's word order
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Отмена"
YES_BUT = "Да"
NO_BUT = "Нет"
DELETE_BUT = "Удалить"
COPY_BUT = "Копировать"
BATCH_BUT = "В очередь"
SEND_BUT = "Отправить"
NEXT_BUT = "Следующий"
PREV_BUT = "Предыдущий"
EXIT_BUT = "Выход"
CONTINUE_BUT = "&Продолжить"
FINISH_BUT = "Готово"
ALWAYS_BUT = "&Всегда"
NEVER_BUT = "&Никогда"
CHECKBOX_REMEMBER = "Запомнить выбор"
MAIN_DEST_DIR_LABEL = "&Папка назначения:"
MAIN_FILE_LABEL = "Ф&айл/операция:"
MAIN_DIRECTORY_LOCK = "Блокировать"
MAIN_DIRECTORY_LOCK_TOOLTIP = "Отключение автоматического выбора каталога,%nнапример, для добавления нескольких файлов в пакетную очередь,%nчтобы не выбирать тот же каталог для каждого из них"
MENU_FILE_LABEL = "&Файл"
MENU_FILE_OPEN_LABEL = "&Открыть…"
MENU_FILE_KEEP_OPEN_LABEL = "Не скрывать"
MENU_FILE_SHOW_LABEL = "Очередь заданий"
MENU_FILE_CLEAR_LABEL = "Очистить очередь"
MENU_FILE_LOG_OPEN_LABEL = "Открыть последний журнал"
MENU_FILE_LOG_FOLDER_OPEN_LABEL ="Открыть папку журнала"
MENU_FILE_LOG_LABEL = "Удалить журнал (%1)"
MENU_FILE_QUIT_LABEL = "&Выход"
MENU_EDIT_LABEL = "&Правка"
MENU_EDIT_SILENT_MODE_LABEL = "Тихий режим"
MENU_EDIT_PASSWORD_LABEL = "Список паролей"
MENU_EDIT_CONTEXT_LABEL = "Добавить в меню ПКМ"
MENU_EDIT_PREFS_LABEL = "&Настройки"
MENU_HELP_LABEL = "Помощь"
MENU_HELP_FEEDBACK_LABEL = "Обратная связь"
MENU_HELP_PLUGINS_LABEL = "Менеджер плагинов"
MENU_HELP_UPDATE_LABEL = "Проверить обновления"
MENU_HELP_WEB_LABEL = "Сайт %1"
MENU_HELP_GITHUB_LABEL = "%name на &Github"
MENU_HELP_STATS_LABEL = "Статистика"
MENU_HELP_PROGDIR_LABEL = "Каталог программы"
MENU_HELP_CONFIGFILE_LABEL ="Открыть файл настроек"
MENU_HELP_ABOUT_LABEL = "О программе"
PREFS_TITLE_LABEL = "Настройки"
PREFS_UNIEXTRACT_OPTS_LABEL = "Основные настройки"
PREFS_HISTORY_LABEL = "Сохранять &историю"
PREFS_UPDATEINTERVAL_LABEL = "Проверка обновлений:"
PREFS_UPDATE_DAILY = "ежедневно"
PREFS_UPDATE_WEEKLY = "еженедельно"
PREFS_UPDATE_MONTHLY = "ежемесячно"
PREFS_UPDATE_YEARLY = "раз в год"
PREFS_UPDATE_NEVER = "никогда"
PREFS_UPDATE_CUSTOM = "каждый %1 день"
PREFS_FORMAT_OPTS_LABEL = "Расширенные настройки"
PREFS_LANG_LABEL = "&Язык:"
PREFS_WARN_EXECUTE_LABEL = "&Запрос перед запуском файлов"
PREFS_WARN_EXECUTE_TOOLTIP = "Некоторые методы извлечения требуют запуска файлов.%nНастройка включает предупреждения перед выполнением таких%nпотенциально опасных действий."
PREFS_CHECK_FREE_SPACE_LABEL = "Проверять свободное место"
PREFS_CHECK_FREE_SPACE_TOOLTIP = "Проверка свободного места на диске перед извлечением."
PREFS_CHECK_UNICODE_LABEL = "Проверка символов Unicode"
PREFS_CHECK_UNICODE_TOOLTIP = "Некоторые специальные символы%n(например, японские на не японских системах)%nмогут вызвать проблемы при извлечении.%nЕсли у вас есть такие проблемы, включите этот параметр,%nчтобы временно переименовывать их автоматически."
PREFS_APPEND_EXT_LABEL = "Исправлять расширения файлов"
PREFS_APPEND_EXT_TOOLTIP = "Исправление отсутствующих или неправильных расширений файлов."
PREFS_HIDE_STATUS_LABEL = "Скрыть строку состояния"
PREFS_HIDE_STATUS_FULLSCREEN_LABEL = "Скрыть если во весь экран"
PREFS_HIDE_STATUS_FULLSCREEN_TOOLTIP = "Скрывать строку состояния в полноэкранном режиме"
PREFS_OPEN_FOLDER_LABEL = "Открыть папку вывода после извлечения"
PREFS_FEEDBACK_PROMPT_LABEL = "Запрос обратной связи"
PREFS_FEEDBACK_PROMPT_TOOLTIP = "Запрос обратной связи после неудачных извлечений."
PREFS_WINDOW_POSITION_LABEL = "Запоминать позицию и размер окна"
PREFS_SEND_STATS_LABEL ="Отправка анонимной статистики"
PREFS_SEND_STATS_TOOLTIP ="Автоматически отправлять статистику%n(какие типы файлов вы извлекаете, какие параметры устанавливаете, произвольный ID пользователя;%nбез имен файлов или информации, которая может быть использована для идентификации).%nЭто помогает определить наиболее используемые модули для их улучшения."
PREFS_LOG_LABEL = "Создавать лог-файлы"
PREFS_VIDEOTRACK_LABEL = "Извлекать видео треки"
PREFS_VIDEOTRACK_TOOLTIP = "По умолчанию видео треки игнорируются при извлечении из видео файлов.%nЭто полезно, если нужно только аудио и вы хотите сэкономить диск и время."
PREFS_TOPMOST_LABEL = "Всегда сверху"
PREFS_BETA_UPDATES_LABEL = "Бета-обновления"
PREFS_SOURCE_FILES_LABEL = "Исходные файлы"
PREFS_SOURCE_FILES_OPT_ASK = "запрос"
PREFS_SOURCE_FILES_OPT_DELETE = "удалять"
PREFS_SOURCE_FILES_OPT_KEEP = "сохранять"
PREFS_SOURCE_FILES_OPT_KEEP_TOOLTIP = "Подтверждать удаление и сохранение исходных файлов."
PREFS_DELETE_ADDITIONAL_FILES_LABEL = "Удалять доп. файлы"
PREFS_DELETE_ADDITIONAL_FILES_TOOLTIP = "%name фильтрует извлеченные файлы и перемещает известные ненужные в каталог:%n'%1'.%nЕсли настройка включена, то эти файлы будут удалятся автоматически.."
FEEDBACK_TITLE_LABEL = "Обратная связь"
FEEDBACK_SYSINFO_LABEL = "Сведения о системе:"
FEEDBACK_OUTPUT_LABEL = "Лог / ошибка %name :"
FEEDBACK_OUTPUT_TOOLTIP = "Возможные сообщения об ошибках или содержимое лог-файла в случае неудачного извлечения"
FEEDBACK_MESSAGE_LABEL = "Сообщение / дополнительная информация:"
FEEDBACK_MESSAGE_TOOLTIP = "Если возможно, пишите на английском или немецком языке"
FEEDBACK_PRIVACY_ACCEPT_LABEL = "Я прочитал и принимаю политику приватности"
FEEDBACK_PRIVACY_VIEW_LABEL = "Политика приватности"
CONTEXT_ENTRIES_LABEL = "Контекстное меню"
CONTEXT_ENABLED_LABEL = "Включить"
CONTEXT_ALL_USERS_LABEL = "Для всех пользователей"
CONTEXT_ADMIN_REQUIRED = "Эта функция требует прав администратора"
CONTEXT_FILE_ASSOC_LABEL = "Ассоциации файлов"
CONTEXT_SIMPLE_RADIO = "Простое"
CONTEXT_CASCADING_RADIO = "Каскадное"
CONTEXT_CASCADING_RADIO_TOOLTIP = "Эта функция требует Windows 7 или новее"
UPDATE_ACTION_INSTALL = "Установить обновления"
UPDATE_STATUS_SEARCHING ="Поиск обновлений..."
UPDATE_TERM_PROGRAM_FILES ="Программные файлы %name"
UPDATE_WHATS_NEW = "Что нового?"
FIRSTSTART_TITLE = "Помощник первого запуска"
FIRSTSTART_PAGES = "Вступление|Настройки|Контекстное меню"
FIRSTSTART_PAGE1 = "Добро пожаловать в %name.%n%nЭтот помощник поможет вам настроить %name и не будет показан снова.%n%nНо сначала-юридические вопросы.%n%nЭто программное обеспечение предоставляется "как есть", без каких-либо гарантий. Используйте его на свой страх и риск. Авторы %name не могут нести ответственность за любой ущерб, возникший в результате использования программного обеспечения. Используя %name, вы соглашаетесь использовать его только в законных целях в соответствии с местным и международным правом. Если вы не принимаете это лицензионное соглашение, вы не имеете права использовать этот инструмент."
FIRSTSTART_PAGE2 = "Во-первых, установите общие параметры извлечения и глобального поведения для %name.%n%nВсе эти настройки доступны в любой момент в меню главного окна программы."
FIRSTSTART_PAGE3 = "%name может интегрироваться в контекстное меню. Извлечь или получить информацию о типе файла можно с помощью правой кнопки мыши без открытия главного окна программы. Выберите какие пункты контекстного меню должны быть показаны.%n%nВсе эти настройки в любой момент доступны в меню главного окна программы."
FFMPEG_LICENSE_ACCEPT_LABEL = "Я прочитал и согласен с лицензионным соглашением"
FFMPEG_LICENSE_VIEW_LABEL = "Посмотреть лицензионное соглашение"
FFMPEG_SELECT_LABEL = "Уже есть FFmpeg?"
FFMPEG_SELECT_TITLE = "Выбрать FFmpeg"
STATS_HEADER_STATUS = "Общий результат распределения"
STATS_HEADER_TYPE = "Извлечения по типу файла"
STATS_STATUS_SUCCESS = "Успех"
STATS_STATUS_FAILED = "Не удалось"
STATS_STATUS_FILEINFO = "Сканирование файлов"
STATS_STATUS_UNKNOWN = "Неизвестный тип файла / не поддерживается"
STATS_NO_DATA = "Не достаточно данных для создания статистики.%n%nПовторите попытку позже."
FILESCAN_TITLE = "Результат проверки файла:"
ABOUT_INFO_LABEL = "by %1%nВерсия 2.0.0 от Bioruebe <%2>%n%n%3%n%nРусский языковой файл от wvxwxvw%n%nЛицензия %4."
ABOUT_VERSION = "Версия %1 (%2)"
METHOD_ADMIN_RADIO = "%1 административная установка"
METHOD_EXTRACTION_RADIO = "%1 извлечение"
METHOD_HEADER = "%1 извлечение"
METHOD_RADIO_LABEL = "Метод извлечения"
METHOD_SWITCH_RADIO = "%1 ключ"
METHOD_NOTIS_RADIO = "Это не инсталлятор InstallShield"
METHOD_TEXT_LABEL = "%name поддерживает несколько методов извлечения %1. К сожалению, ни один из этих методов не надёжен на 100%. Если заданный по умолчанию метод не работает, запустите %name ещё раз и выберите альтернативный метод."
METHOD_UNPACKER_RADIO = "%1 распаковщик"
METHOD_GAME_LABEL = "Файл %1 вероятно игровой архив. %name может обрабатывать несколько типов пакетов игр, но не может определить, из какой игры файл. Если файл принадлежит игре, выберите ее из списка ниже. В противном случае выберите '%2' или нажмите '%3', чтобы попытаться извлечь пакет другим способом."
METHOD_GAME_NOGAME = "Игра отсутствует в списке"
METHOD_NOT_IN_LIST = "Ничего из этого"
METHOD_FILE_SELECT_LABEL = "Для извлечения %1 необходим дополнительный файл данных, но %name не может определить, какой именно.%n%nВыберите один из следующих вариантов. Если извлечение не работает правильно, попробуйте еще раз с другим выбором."
METHOD_EXTRACTOR_SELECT_LABEL = "%nСписок ниже содержит шорткод для каждого типа файлов, поддерживаемого в настоящее время %name.%n%nВыберите тип извлечения для использования. Выберите '%2', чтобы автоматически определить тип файла, как при обычном запуске %name."

; GUI control functions
EXTRACT_TO = "Извлечь в"
INVALID_FILE_SELECTED = "%1Пожалуйста, выберите верный файл."
OPEN_FILE = "Открыть файл"
SELECT_FILE = "Выбрать файл"
UPDATE_CURRENT = "Вы используете самую последнюю версию %name."

; Common terms
TERM_ARCHIVE = "архива"
TERM_AUDIO = "аудио"
TERM_COMPILED = "Компилирован"
TERM_COMPRESSED = "сжатого файла"
TERM_CONTAINER = "контейнера"
TERM_DATABASE = "базы данных"
TERM_DISK = "диска"
TERM_DOWNLOAD = "Загрузить"
TERM_DOWNLOADING = "Загружается"
TERM_EBOOK = "ebook"
TERM_ECARD = "ecard"
TERM_ENCODED = "кодированного файла"
TERM_ENCRYPTED ="зашифрованного файла"
TERM_ERROR = ""
TERM_EXECUTABLE ="исполняемого файла"
TERM_EXTRACT = "Извлечь"
TERM_FILE = "файла"
TERM_GAME = "Игры"
TERM_HELP = "Файла справки"
TERM_HOTFIX = "хотфикса"
TERM_IMAGE = "образа"
TERM_INSTALLED = "Установлен"
TERM_INSTALLER = "инсталлятора"
TERM_LOADING = "Загрузка..."
TERM_MERGE_MODULE = "модуля слияния"
TERM_OVERALL_PROGRESS ="Общий прогресс"
TERM_PACKAGE = "пакета"
TERM_PAGE = "страницы"
TERM_PATCH = "патча"
TERM_RECONSTRUCTED ="Восстановлен"
TERM_SCAN = "Анализ"
TERM_SCRIPT = "скрипт"
TERM_SFX = "SFX"
TERM_STAGE = "Этап"
TERM_TESTING = "Тестирование"
TERM_TRANSLATION = ""
TERM_UNKNOWN = "неизвестный"
TERM_UNPACKED = "неупакованный"
TERM_UPDATER = "обновление"
TERM_VIDEO = "Видео"

; Status messages
SCANNING_FILE = "Анализ файла %1"
SCANNING_EXE = "Анализ файла с помощью %1."
EXTRACTING = "Извлечение файлов из:"
INIT_WAIT = "Ожидание запуска инсталлятора.%nПожалуйста, подождите."
SENDING_FEEDBACK = "Отправка сообщений"
INPUT_NEEDED = "Ручной ввод"
SEARCHING_PASSWORD = "Поиск пароля"
TESTING_PASSWORD = "Пробую пароли (%1/%2)"
MOVING_FILE = "Переместить в"
RENAMING_FILES = "Переименование файлов (%1/%2)"

; Custom prompts
CONVERT_CDROM = "%1 образы не могут быть извлечены напрямую. Образ будет преобразован в ISO-образ, который и будет извлечен.%n%nПродолжить?%nПримечание: этот процесс займет нескольких минут."
CONVERT_CDROM_STAGE1_FAILED = "Ошибка: CD-образ не может быть преобразован.%nЕсли это BIN/CUE-образ, убедитесь в правильности формата файла CUE."
CONVERT_CDROM_STAGE2_FAILED = "Ошибка: ISO образ был создан, но он не может быть конвертирован.%nХотите сохранить ISO образ для дальнейшего анализа?"
INIT_COMPLETE = "Инициализация завершена. Выйдите из инсталлятора и нажмите 'OK' для продолжения."
UNPACK_PROMPT = "Этот файл упакован с %1 сжатием, но не может быть извлечён.%nВозможно, тип файла не поддерживается, или%nпросто нет файлов, которые можно было бы извлечь.%n%nВсё равно хотите распаковывать этот файл?%n%nПримечание: Распакованный файл будет назван:%n%2"
UNPACK_FAILED = "Ошибка: %1%nне может быть распакован."
UNPACK_AGAIN = "%1 успешно распакован. %n%nВы хотите что бы %name попытался извлечь %2?"
NSIS_BINFILES = "Примечание: %1 был успешно извлечен. %nОднако имеются data.bin файлы в том же каталоге где и файл %2. Они могут быть частью установочных файлов. %n%nНажмите ОК что бы %name распаковал их или нажмите Отмена."
WARN_EXECUTE = "Внимание: для того, чтобы извлечь содержимое файлов такого типа, файл необходимо запустить.%nЕсли продолжить, будет выполнена следующая команда:%n%n%1%n%nЕсли вы предполагаете, что этому файлу не следует доверять (как "злонамеренному"), продолжать не рекомендуется.%nПродолжить извлечение?"
FEEDBACK_SUCCESS = "Спасибо за ваш отзыв. Ваше сообщение будет обработано в ближайшее время."
FEEDBACK_PROMPT = "Чтобы улучшить дальнейшие версии %name, вы можете сообщить разработчикам о проблемах.%nЖурналы извлечений содержат ценную информацию о файле и потенциальных ошибках, которые могли возникнуть во время извлечения.%n%nХотите открыть интерфейс обратной связи прямо сейчас?"
FEEDBACK_PRIVACY = "Конфиденциальность: файлы обратной связи хранятся на наших серверах, до тех пор, пока они обрабатываются разработчиком и впоследствии удаляются. Данные не передаются третьим лицам. Вы можете запросить удаление в любое время через email.%n%nЛог может включать сведения о системе, а также часть содержимого файла. Если вы не хотите отправлять какую либо информацию, просто удалите ее.%n%nВы принимаете это соглашение и хотите отправить сообщение? Если нет ничего передано не будет."
FEEDBACK_OUTDATED = "Внимание: Вы используете устаревшую версию %name.%n%nПеред тем, как сообщить о проблеме, убедитесь, что она присутствует в последней версии. Спасибо"
FFMPEG_NEEDED = "Похоже, что %1 это мультимедийный файл.%n%nДля извлечения всех видео и аудио треков необходим FFmpeg. Просто нажмите кнопку %2, и все будет загружено и настроено автоматически."
PLUGIN_MISSING = "Для того, чтобы извлечь %1, необходимы дополнительные вспомогательные программы.%n%nИспользуйте кнопку ниже, чтобы открыть менеджер плагинов и загрузить выбранный вспомогательный модуль. Затем используйте кнопку '%2', чтобы добавить его в %name. После закрытия менеджера плагинов извлечение продолжится."
UPDATE_PROMPT = "Доступно обновление для %1.%n% Хотите загрузить его сейчас?"
FILE_COPY = "Чтобы правильно обработать файл %1 , нужно создать копию. В зависимости от размера файла, это может занять некоторое время.%n%nУбедитесь, что имеется достаточно свободного места и нажмите OK для продолжения."
FILE_DELETE = "Файл %1 успешно извлечен. Хотите что бы %name удалил оригинальный файл?%n%nПримечание: возможно, что извлеченные файлы будут не пригодны для использования. Нажмите 'Да', только если уверены, что извлечение успешно.%n(это сообщение можно отключить в настройках.)"
BATCH_DUPLICATE = "Файл %1 уже есть в очереди пакетной обработки.%n%nДобавляем? (будет извлечен дважды)"
NO_FREE_SPACE = "Внимание:%nДиск вывода %1 имеет меньше свободного места, чем размер входного файла.%n%nСвободного места:%t%2 МБ%nТребуется места:%t>%3 МБ%nРазница:%t~%4 МБ"
CONTEXT_DANGEROUS = "Внимание:%nИзменение ассоциаций может быть опасно. Например изменение ассоциации .exe приведет к неработоспособности системы. Убедитесь, что вы знаете, что делаете.%n%nУверены, что надо продолжать?"
ELEVATION_REQUIRED = "Доступ запрещен.%n%n%name сейчас будет перезагружен от администратора. Попробуйте после этого снова."
ACCESS_DENIED = "Доступ запрещен.%n%n%name уже запущен от администратора. Убедитесь, что у вас есть необходимые для выполнения действий права и повторите попытку."
MOVE_FAILED ="Не удалось копировать %1 в %2. Если путь содержит специальные символы, попробуйте переименовать файл или переместить его в папку с обычным именем. Таким образом, %name не придется копировать его во временную папку. Затем снова запустите извлечение."

; Help text
HELP_SUMMARY = "Извлечение файлов из архива любого типа или инсталляционного пакета."
HELP_SYNTAX = "%nИспользование: %n%n%1 [/help | /prefs | /remove | /batchclear] [ имя файла [/scan | destination] [/silent][/batch]]"
HELP_ARGUMENTS = "%n%nДопустимые параметры:"
HELP_HELP = "%n     %1%t%tПоказать справку"
HELP_PREFS = "%n     %1%t%tДиалог настройки UniExtract"
HELP_REMOVE = "%n     %1%tУдаление всех пунктов контекстного меню%n%t%tи ассоциаций файлов"
HELP_CLEAR = "%n     %1%tОчистить очередь и отключить пакетный режим"
HELP_UPDATE = "%n     %1%tПроверить обновления"
HELP_SCAN = "%n     %1%t%tИнформация о типе файла"
HELP_FILENAME = "%n     filename%tИмя извлекаемого файла"
HELP_DESTINATION = "%n     destination%tПуть папки для извлечения"
HELP_SILENT = "%n     %1%t%tТихий режим (без подтверждений)"
HELP_BATCH = "%n     %1%t%tДобавить файл в очередь"
HELP_SUB = "%n%nПараметр %1 вместо каталога извлечения заставляет%n%name извлекать файлы в подпапку с именем архива."
HELP_LAST = "с %1 будет использован последний используемый каталог."
HELP_EXAMPLE1 = "%n%nПример:"
HELP_EXAMPLE2 = "%n     %1 c:\1\example.zip c:\test"
HELP_NOARGS = "%n%nПри запуске %name без параметров будет выдан запрос про имя файла и папку для извлечения."

; Error messages
UNKNOWN_FILETYPE_TITLE = "Неизвестный тип файла"
UNKNOWN_FILETYPE = "%1 не может быть извлечен. Тип файла точно не определен.%n%nЕсли у вас есть более подробная информация об этом типе файла, пожалуйста, свяжитесь с нами, используя форму обратной связи."
INVALID_FILE = "Файл для извлечения,%n%n%1%,n%nне найден. Выберите правильный входящий файл.%n%n%1"
INVALID_DIR = "%1 невозможно создать. Выберите правильный путь назначения."
NO_HISTORY = "%1 не может быть извлечен.%nПоследний использованный каталог не считан.%n%nУбедитесь, что %2 включен, и вы прежде извлекали хотя бы один файл."
EXTRACT_FAILED = "%1 не может быть извлечен.%nВозможно это %2, который поддерживается, но извлечение неудачно.%n%nХотите что бы %name создал подробный лог и отобразил его?"
NOT_PACKED = "%1 не может быть извлечен, файл is%n%n%2"
DOWNLOAD_FAILED = "Файл %1 не может быть загружен. Убедитесь, что вы подключены к интернету и повторите попытку."
UPDATECHECK_FAILED = "Проверка обновлений не удалась. Убедитесь, что вы подключены к интернету и попробуйте снова."
UPDATE_FAILED = "Некоторые файлы не обновились.%n%nПовторите попытку, перезагрузив %name от имени администратора."
UPDATE_NOADMIN = "%name не имеет прав администратора.%n%nЩелкните ПКМ значок программы %name и выберите 'Запуск от имени администратора', и повторите поиск обновлений."
FFMPEG_MOVE_FAILED = "FFmpeg не удалось правильно настроить. Запустите программу %name, от имени администратора и повторите попытку."
FFMPEG_INVALID_FILE = "Выбранный файл не является поддерживаемой версией FFmpeg.%n%nFFmpeg доступен в двух версиях: как один большой исполняемый файл ('static') и как папка с множеством .dll ('shared'). %name поддерживает только первое."
FEEDBACK_EMPTY = "Пожалуйста, постарайтесь дать как можно больше информации, для ускорения обработки вашего отзыва."
FEEDBACK_ERROR = "Не удалось отправить отзыв. Пожалуйста, повторите попытку позже или отправьте свой отчет по электронной почте или на Github. Спасибо.%n%nПроизошла следующая ошибка: %1"
FEEDBACK_PRIVACY_NOT_ACCETPED = "Примите политику приватности, чтобы отправить отзыв."
LICENSE_NOT_ACCEPTED = "Примите лицензионное соглашение, чтобы продолжить."
BATCH_FINISH = "Пакетная обработка завершена, но не все файлы были успешно извлечены. Следующие файлы привели к ошибке:%n%n%1%nДля дополнительной информации, читайте соответствующие лог-файлы (доступно только, если ведение журнала включено)."
NOT_SUPPORTED_TITLE = "Неподдерживаемый тип файла"
NOT_SUPPORTED = "%1 не может быть извлечен.%n%n%name пока не поддерживает этот тип файла.%n%nЕсли у вас есть информация о том, как извлечь файл, пожалуйста, отправьте нам сообщение и помогите сделать %name лучше."
MISSING_EXE = "%1 не может быть извлечен.%n%nВспомогательный модуль %2 не найден."
EXTRACT_TIMEOUT = "%1 не может быть извлечен.%n%nПревышен таймаут. Если проблема временная, то другая попытка может привести к успеху."
WRONG_PASSWORD = "%1 не может быть извлечен.%n%nФайл защищен паролем и пароль, который вы ввели, неверный.%n%nПодсказка: Используйте встроенный автоматический поиск паролей, в пользовательском списке паролей, который можно найти в меню %2 ."
NO_FREE_SPACE_ERROR = "Не удалось и звлечь %1.%n%nНедостаточно места на диске вывода. Освободите место и повторите попытку.."
MISSING_PART = "Не удалось и звлечь %1.%n%nАрхив состоит из нескольких частей. Все они необходимы для извлечения, но некоторые из них отсутствуют.%n%nУбедитесь, что все части находятся в одном каталоге, и повторите попытку."
PLUGIN_IMPORT_MISSINGFILES = "Ошибка импорта плагина %1.%n%nНе все файлы выбраны. Повторите попытку выберав все следующие файлы:%n%n%2"
MISSING_DEFINITION = "%1 не может быть извлечен.%n%nНе удалось найти файл определения %2.%n%nЕсли это настраиваемый плагин, убедитесь, что вы настроили его правильно."
OPEN_URL_FAILED = "%name не удалось открыть веб-ссылку.%n%nОткройте ваш браузер и вручную введите следующий URL-адрес:"

; Plugin descriptions
PLUGIN_SUPPORTED_FILETYPES = "Поддерживаемые типы файлов:"
PLUGIN_ARC_CONV = "Экстракторы некоторых игровых архивов"
PLUGIN_ISCAB = "Часть пакета installshield для извлечения cab-файлов. Он может работать лучше, чем общие модули извлечения Universal Extractor, но является не бесплатным."
PLUGIN_THINSTALL = "Экстрактор для Thinstall портативок"
PLUGIN_UNREAL = "Экстрактор для Unreal Engine архивов"
PLUGIN_WINTERMUTE = "Экстрактор для архивов игр на движке WinterMute"
PLUGIN_CI = "Плагин для инсталляторов CreateInstall, download, install, copy files %1, %2, %3 в папку \bin"
PLUGIN_DGCA = "Декомпрессор для архивов DGCA"
PLUGIN_BOOTIMG = "Экстрактор для загрузочных образов Android"
PLUGIN_IS5COMP = "Поддержка извлечения старых InstallShield cabinet архивов"
PLUGIN_SIM = "Экстрактор Smart Install Maker инсталляторов"
PLUGIN_WOLF = "Использовать дополнительные утилиты извлечения для зашифрованных игровых архивов WOLF RPG"
PLUGIN_EXTSIS = "Экстрактор для новых пакетов Symbian OS"

; Context Menu integration
EXTRACT_FILES = "Открыть в UniExtract"
EXTRACT_HERE = "Распаковать здесь"
EXTRACT_SUB = "Распаковать в подпапку"
EXTRACT_LAST = "Распаковать в последнюю"
SCAN_FILE = "Анализировать файл"

; Other
DIR_ADDITIONAL_FILES = "Дополнительные файлы"

[Installer]
; Components page
COMP_FULL = "Полная установка"
COMP_COMPACT = "Компактная установка"
COMP_CUSTOM = "Выборочная установка"
COMP_MAIN = "Основные файлы Universal Extractor"
COMP_DOCS = "Документация и информация о лицензии"
COMP_LANG = "Языковые файлы"
COMP_SOURCE = "Исходный код Universal Extractor"

; Tasks page
MODIFY_PATH = "Добавить Universal Extractor в системные пути"
DESKTOP_ICON = "Создать ярлык на рабочем столе"
QUICK_LAUNCH_ICON = "Создать ярлык в панели быстрого запуска"
SENDTO_ICON = "Создать ярлык в меню "Отправить..."
